billing_cf/Documents/бестИзменениеТемпературногоГрафикаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменениеТемпературногоГрафикаОбъектов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемпературныйГрафик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТемпературныйГрафикПредЗн</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

billing_cf/Documents/бестИзменениеТемпературногоГрафикаОбъектов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
		КонецЕсли;
	КонецЕсли;
		
	// ++ Акимов Д.В.
	// Настройка доступности в зависимости от прав
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, Новый Структура("Контрагент, ОбъектРасчета, СтруктураСети"), Метаданные.Документы.бестИзменениеТемпературногоГрафикаОбъектов);
	// -- Акимов Д.В.
		// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункции

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	//Если ЗначениеЗаполнено(Объект.Организация) Тогда
	//	Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ЗаполнитьПериодНачисленияСервер();
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыРасчетаПередУдалением(Элемент, Отказ)
	Отказ 			= Истина;
	ДопПараметры	= Новый Структура;
	ДопПараметры.Вставить("ТекущийОбъект", 	Объект.Ссылка);
	ДопПараметры.Вставить("ТЧ", 			"ОбъектыРасчета");
	ДопПараметры.Вставить("НомерСтроки", 	Элемент.ТекущиеДанные.НомерСтроки-1);
	ПроверкаУдаленияСтроки(ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаУдаленияСтроки(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ВопросУдаленияСтроки",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Удалить всю строку вместо значения ячейки?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУдаленияСтроки(РезультатВопроса,ДополнительныеПараметры) Экспорт 
	Если ТипЗнч(РезультатВопроса) = Тип("КодВозвратаДиалога") тогда		
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			УдалитьСтроку(ДополнительныеПараметры);			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
	ЗаполнитьПериодНачисленияСервер();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
	
	СтруктураСети 	= Неопределено;
	
	Объект.ОбъектыРасчета.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПериодНачисленияСервер();
	Объект.Район	= Неопределено;
	СтруктураСети 	= Неопределено;
	
	Объект.ОбъектыРасчета.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СтруктураСетиПриИзменении(Элемент)
	Объект.ОбъектыРасчета.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	Объект.ОбъектыРасчета.Очистить();
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Организация КАК Организация,
	               |	бестСтруктураСетиТочекУчетаНПСрезПоследних.Район КАК Район,
	               |	бестСтруктураСетиТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	               |	ИСТИНА КАК Флаг,
	               |	бестСтруктураСетиТочекУчетаНПСрезПоследних.СтруктураСети КАК СтруктураСети
	               |ПОМЕСТИТЬ ВТ_СтруктураСети
	               |ИЗ
	               |	РегистрСведений.бестСтруктураСетиТочекУчетаНП.СрезПоследних(
	               |			&Дата,
	               |			СтруктураСети = &СтруктураСети
	               |				И ОбъектРасчета = &ОбъектРасчета) КАК бестСтруктураСетиТочекУчетаНПСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ВТ_СтруктураСети.Организация КАК Организация,
	               |	ВТ_СтруктураСети.Район КАК Район,
	               |	ВТ_СтруктураСети.ОбъектРасчета КАК ОбъектРасчета,
	               |	ВТ_СтруктураСети.Флаг КАК Флаг,
	               |	ВТ_СтруктураСети.СтруктураСети КАК СтруктураСети,
	               |	бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.ТемпературныйГрафик КАК ТемпературныйГрафикПредЗн
	               |ИЗ
	               |	ВТ_СтруктураСети КАК ВТ_СтруктураСети
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестТемпературныеГрафикиДоговоровСЮридическимиЛицами.СрезПоследних(&Дата, ) КАК бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних
	               |		ПО ВТ_СтруктураСети.Организация = бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.Организация
	               |			И ВТ_СтруктураСети.Район = бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.Район
	               |			И ВТ_СтруктураСети.ОбъектРасчета = бестТемпературныеГрафикиДоговоровСЮридическимиЛицамиСрезПоследних.ОбъектРасчета";
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Район) Тогда
		Запрос.УстановитьПараметр("Район", Объект.Район);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураСети) Тогда
		Запрос.УстановитьПараметр("СтруктураСети", СтруктураСети);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтруктураСети = &СтруктураСети", "Истина");
	КонецЕсли;

	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета = &ОбъектРасчета", "Истина");
	КонецЕсли;

	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Дата = &Дата", "Истина");
	КонецЕсли;

	
	Результат = Запрос.Выполнить();
	Выгрузка = Результат.Выгрузить();
	
	Объект.ОбъектыРасчета.Загрузить(Выгрузка);
КонецПроцедуры
#КонецОбласти
